Repository: EternalTimes/wslcontainerdesktop
Catalog: src/WslContainerDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# Settings_Title.Text
source: Settings
zh_hans: 设置

# Settings_Language_Header.Text
source: Language
zh_hans: 语言

# Settings_Language_Label.Text
source: Language
zh_hans: 界面语言

# Settings_Language_Help.Text
source: Applies immediately.
zh_hans: 立即生效。

# Settings_Language_Option_System
source: Match system
zh_hans: 跟随系统

# Settings_Appearance_Header.Text
source: Appearance
zh_hans: 外观

# Settings_Theme_Label.Text
source: Theme
zh_hans: 主题

# Settings_Theme_Help.Text
source: Applies immediately.
zh_hans: 立即生效。

# Settings_Theme_Option_System
source: Use system default
zh_hans: 跟随系统

# Settings_Theme_Option_Light
source: Light
zh_hans: 浅色

# Settings_Theme_Option_Dark
source: Dark
zh_hans: 深色

# Nav_Assistant.Text
source: Assistant
zh_hans: 助手

# Nav_Dashboard.Content
source: Dashboard
zh_hans: 仪表板

# Nav_Containers.Content
source: Containers
zh_hans: 容器

# Nav_Images.Content
source: Images
zh_hans: 镜像

# Nav_Volumes.Content
source: Volumes
zh_hans: 数据卷

# Nav_Networks.Content
source: Networks
zh_hans: 网络

# Nav_Endpoints.Content
source: Endpoints
zh_hans: 端口映射

# Nav_Activity.Content
source: Activity
zh_hans: 活动

# Nav_Registries.Content
source: Registries
zh_hans: 镜像仓库

# Nav_DevContainers.Content
source: Dev Containers
zh_hans: 开发容器

# Nav_Templates.Content
source: Templates
zh_hans: 模板

# Nav_WslEngine.Content
source: WSL engine
zh_hans: WSL 引擎

# Nav_Reclaim.Content
source: Disk usage
zh_hans: 磁盘占用

# Nav_Settings.Content
source: Settings
zh_hans: 设置

# Settings_Toggle.OnContent
source: On
zh_hans: 开

# Settings_Toggle.OffContent
source: Off
zh_hans: 关

# Update_WhatsNew.Content
source: What's new
zh_hans: 更新说明

# Settings_Engine_Header.Text
source: Container engine
zh_hans: 容器引擎

# Settings_Engine_Path_Header.Header
source: Path to wslc.exe
zh_hans: wslc.exe 路径

# Settings_Engine_Test.Content
source: Test connection
zh_hans: 测试连接

# Settings_Engine_Version.Text
source: Engine version:
zh_hans: 引擎版本：

# Settings_DevContainers_Header.Text
source: Dev Containers
zh_hans: 开发容器

# Settings_DevContainers_Registry_Header.Header
source: npm registry for feature builds
zh_hans: 用于构建 feature 的 npm registry

# Settings_DevContainers_Registry_Help.Text
source: Node/npm-based Dev Container features fetch packages from the public npm registry, which some corporate networks block. Set a registry or proxy URL here and it will be injected into feature builds as NPM_CONFIG_REGISTRY. Leave blank to use each feature's default.
zh_hans: 基于 Node/npm 的开发容器 feature 会从公共 npm registry 拉取包，而部分企业网络会拦截这些请求。在此填写 registry 或代理 URL，它会作为 NPM_CONFIG_REGISTRY 注入到 feature 构建中。留空则使用各 feature 的默认设置。

# Settings_Behavior_Header.Text
source: Behavior
zh_hans: 行为

# Settings_Behavior_CloseToTray_Label.Text
source: Minimize to system tray on close
zh_hans: 关闭时最小化到系统托盘

# Settings_Behavior_CloseToTray_Help.Text
source: Keep the app running in the tray instead of exiting.
zh_hans: 保持应用在托盘运行而不是退出。

# Settings_Behavior_Animations_Label.Text
source: Animations
zh_hans: 动画

# Settings_Behavior_Animations_Help.Text
source: Slide pages and lists in and animate the navigation highlight. Turn off for instant, animation-free navigation. Progress indicators still spin.
zh_hans: 为页面和列表的滑入以及导航高亮添加动画。关闭后导航即时完成、无动画，进度指示器仍会旋转。

# Settings_Behavior_StartMinimized_Label.Text
source: Start minimized to tray
zh_hans: 启动时最小化到托盘

# Settings_Behavior_StartMinimized_Help.Text
source: Launch into the tray without showing the window.
zh_hans: 直接启动到托盘，不显示窗口。

# Settings_Behavior_Restart_Label.Text
source: Restart running containers on launch
zh_hans: 启动时重启正在运行的容器

# Settings_Behavior_Restart_Help.Text
source: After a reboot or WSL shutdown, start any containers that were running again. Containers you stopped yourself stay stopped.
zh_hans: 重启系统或关闭 WSL 后，重新启动之前正在运行的容器。你手动停止的容器保持停止状态。

# Settings_Behavior_SignIn_Label.Text
source: Start when I sign in
zh_hans: 登录时启动

# Settings_Behavior_Refresh_Label.Text
source: Auto-refresh interval
zh_hans: 自动刷新间隔

# Settings_Behavior_Refresh_Help.Text
source: How often container status is polled (seconds).
zh_hans: 轮询容器状态的频率（秒）。

# Settings_Notify_Header.Text
source: Notifications
zh_hans: 通知

# Settings_Notify_Master_Label.Text
source: Show notifications
zh_hans: 显示通知

# Settings_Notify_Master_Help.Text
source: Master switch for toast notifications. Turn off to mute everything.
zh_hans: Toast 通知的总开关。关闭后静音所有通知。

# Settings_Notify_Image_Label.Text
source: Image pull & build
zh_hans: 镜像拉取与构建

# Settings_Notify_Image_Help.Text
source: Notify when an image pull or build completes or fails.
zh_hans: 镜像拉取或构建完成、失败时通知。

# Settings_Notify_Stopped_Label.Text
source: Container stopped
zh_hans: 容器已停止

# Settings_Notify_Stopped_Help.Text
source: Notify when a running container exits or crashes.
zh_hans: 运行中的容器退出或崩溃时通知。

# Settings_Notify_Engine_Label.Text
source: Engine availability
zh_hans: 引擎可用性

# Settings_Notify_Engine_Help.Text
source: Notify when the container engine goes down or recovers.
zh_hans: 容器引擎宕机或恢复时通知。

# Settings_Ai_Header.Text
source: AI diagnostics
zh_hans: AI 诊断

# Settings_Ai_Enable_Label.Text
source: Enable AI features
zh_hans: 启用 AI 功能

# Settings_Ai_Enable_Help.Text
source: Off by default. Diagnosis offers a reviewable preview; assistant chat sends sanitized text and tool evidence during each turn.
zh_hans: 默认关闭。诊断会提供可审阅的预览；助手对话在每轮中发送经过清理的文本和工具证据。

# Settings_Ai_QuickStart_Title.Text
source: Quick start: run AI locally
zh_hans: 快速开始：在本地运行 AI

# Settings_Ai_QuickStart_Help.Text
source: One click sets up Ollama in an app-managed container, downloads a model if you need one, and selects it as your provider.
zh_hans: 一键在应用管理的容器中配置 Ollama，按需下载模型，并将其选为你的提供方。

# Settings_Ai_WhatSetup_Header.Header
source: What setup does
zh_hans: 配置会做什么

# Settings_Ai_WhatSetup_P1.Text
source: Setup manages only the app's own container on 127.0.0.1 and reuses an Ollama image already on this machine. It never adopts unrelated runtimes.
zh_hans: 配置只管理应用自己在 127.0.0.1 上的容器，并复用本机已有的 Ollama 镜像，绝不接管无关的运行时。

# Settings_Ai_WhatSetup_P2.Text
source: If no model is installed, setup offers to download one and asks first. You can pick a different model below at any time.
zh_hans: 如果没有安装模型，配置会先询问再下载。你随时可以在下方选择其他模型。

# Settings_Ai_WhatSetup_P3.Text
source: GPU acceleration and model capabilities are never assumed; setup checks what the model supports and tells you the result.
zh_hans: 配置不会假定 GPU 加速或模型能力，而是检查模型实际支持什么并告知结果。

# Settings_Ai_SetupOllama.Text
source: Set up Ollama
zh_hans: 配置 Ollama

# Settings_Ai_CancelSetup.Content
source: Cancel setup
zh_hans: 取消配置

# Settings_Ai_RemoveOllama.Content
source: Remove Ollama
zh_hans: 移除 Ollama

# Settings_Ai_Technical_Header.Header
source: Technical details
zh_hans: 技术细节

# Settings_Ai_CopyDetails.Content
source: Copy details
zh_hans: 复制详情

# Settings_Ai_Provider_Header.Header
source: Provider
zh_hans: 提供方

# Settings_Ai_Provider_None.Content
source: None
zh_hans: 无

# Settings_Ai_Provider_Copilot.Content
source: GitHub Copilot (recommended)
zh_hans: GitHub Copilot（推荐）

# Settings_Ai_Provider_Ollama.Content
source: Ollama (local)
zh_hans: Ollama（本地）

# Settings_Ai_Provider_OpenAI.Content
source: OpenAI-compatible
zh_hans: OpenAI 兼容

# Settings_Ai_Privacy_Header.Header
source: Data sharing and privacy
zh_hans: 数据共享与隐私

# Settings_Ai_Privacy_Help.Text
source: Recognized sensitive fields and credential patterns are masked before AI evidence and assistant audit details are shortened. Detection is not perfect: unlabelled or encoded secrets may remain. Review diagnosis previews and do not paste secrets into chat. The selected provider receives chat and tool evidence; local inference requires a local endpoint. Diagnosis fixes are copy-only; assistant mutations follow the app's approval settings.
zh_hans: 在精简 AI 证据和助手审计详情之前，已识别的敏感字段与凭据模式会被遮盖。识别并不完美：未标注或经过编码的密钥可能残留。请审阅诊断预览，不要把密钥粘贴到对话中。你选择的提供方会收到对话和工具证据；本地推理需要本地端点。诊断修复仅供参考复制；助手的变更操作遵循应用的审批设置。

# Settings_Ai_ProviderSettings_Header.Header
source: Provider settings
zh_hans: 提供方设置

# Settings_Ai_Copilot_SignIn.Content
source: GitHub Copilot sign-in info
zh_hans: GitHub Copilot 登录信息

# Settings_Ai_Copilot_Model_Header.Header
source: GitHub Copilot model
zh_hans: GitHub Copilot 模型

# Settings_Ai_Copilot_Refresh.Content
source: Refresh models
zh_hans: 刷新模型列表

# Settings_Ai_Ollama_Endpoint_Header.Header
source: Ollama endpoint
zh_hans: Ollama 端点

# Settings_Ai_Ollama_Model_Header.Header
source: Ollama model (installed)
zh_hans: Ollama 模型（已安装）

# Settings_Ai_Ollama_Model_Help.Text
source: Downloads a model on the configured endpoint, which may be remote. Model names and tags can change over time, so a name alone does not tell you what you will get or whether it supports tool calling.
zh_hans: 在配置的端点上下载模型，该端点可能是远程的。模型名称和标签会随时间变化，仅凭名称无法判断你会得到什么，或它是否支持工具调用。

# Settings_Ai_Ollama_Pull.Header
source: Pull a model
zh_hans: 拉取模型

# Settings_Ai_Ollama_Pull.PlaceholderText
source: Audited model reference
zh_hans: 已审计的模型标识

# Settings_Ai_Ollama_PullButton.Content
source: Pull
zh_hans: 拉取

# Settings_Ai_Azure_Endpoint_Header.Header
source: Azure OpenAI endpoint
zh_hans: Azure OpenAI 端点

# Settings_Ai_Azure_Deployment_Header.Header
source: Azure OpenAI deployment
zh_hans: Azure OpenAI 部署名称

# Settings_Ai_OpenAI_Endpoint_Header.Header
source: OpenAI-compatible endpoint (base URL)
zh_hans: OpenAI 兼容端点（基础 URL）

# Settings_Ai_OpenAI_Endpoint_Help.Text
source: Point this at any server that speaks the OpenAI chat-completions API. Examples: https://api.openai.com/v1 (OpenAI), http://localhost:11434/v1 (Ollama), http://localhost:1234/v1 (LM Studio), http://localhost:8000/v1 (vLLM / llama.cpp). Include the version segment your server uses; /chat/completions is appended automatically.
zh_hans: 指向任何支持 OpenAI chat-completions API 的服务器。示例：https://api.openai.com/v1（OpenAI）、http://localhost:11434/v1（Ollama）、http://localhost:1234/v1（LM Studio）、http://localhost:8000/v1（vLLM / llama.cpp）。请包含你的服务器所用的版本段；/chat/completions 会自动追加。

# Settings_Ai_OpenAI_Model_Header.Header
source: OpenAI-compatible model
zh_hans: OpenAI 兼容模型

# Settings_Ai_ApiKey.Header
source: API key
zh_hans: API 密钥

# Settings_Ai_ApiKey.PlaceholderText
source: Stored in Windows Credential Manager (optional for local OpenAI-compatible servers)
zh_hans: 保存在 Windows 凭据管理器中（本地 OpenAI 兼容服务器可不填）

# Settings_Ai_SaveKey.Content
source: Save key
zh_hans: 保存密钥

# Settings_Ai_Capabilities_Help.Text
source: Verify capabilities separately. Tests use synthetic prompts, never container data or app actions.
zh_hans: 单独验证能力。测试使用合成的提示词，绝不涉及容器数据或应用操作。

# Settings_Ai_TestCapabilities.Content
source: Test capabilities
zh_hans: 测试能力

# Settings_Ai_CancelTest.Content
source: Cancel test
zh_hans: 取消测试

# Settings_Ai_Permissions_Header.Header
source: Container AI Assistant permissions
zh_hans: 容器 AI 助手权限

# Settings_Ai_Permissions_Help.Text
source: Read-only tools always run automatically. For every other tool, turn its switch on to let the assistant run it without asking. Anything left off will prompt you for approval each time.
zh_hans: 只读工具始终自动运行。其他每个工具，打开其开关即可让助手无需询问直接运行。未打开的工具每次都会请求你的批准。

# Settings_Ai_AllowDelete.Header
source: Allow the assistant to delete things
zh_hans: 允许助手删除内容

# Settings_Ai_AllowDelete.OffContent
source: Off — it cannot delete
zh_hans: 关 — 不能删除

# Settings_Ai_AllowDelete.OnContent
source: On — it can delete
zh_hans: 开 — 可以删除

# Settings_Ai_AllowDelete_Help.Text
source: Off by default. Until you turn this on, the assistant cannot remove containers, volumes or networks, or delete Kubernetes resources — it will say the action is turned off instead of asking. Removing a volume destroys the data in it.
zh_hans: 默认关闭。在你打开之前，助手无法移除容器、数据卷或网络，也无法删除 Kubernetes 资源 — 它会直接说明该操作已关闭，而不会询问。移除数据卷会销毁其中的数据。

# Settings_Ai_AutoApprove.Header
source: Let the assistant act without asking
zh_hans: 让助手无需询问即可执行

# Settings_Ai_AutoApprove.OffContent
source: Ask me first (recommended)
zh_hans: 先询问我（推荐）

# Settings_Ai_AutoApprove.OnContent
source: Never ask
zh_hans: 从不询问

# Settings_Ai_AutoApprove_Help.Text
source: Skips every prompt, including the Compose review that the switches below cannot turn off. It only waives asking — it does not grant deleting, and plans the app cannot apply safely are still refused. Everything still appears in Activity.
zh_hans: 跳过所有提示，包括下方开关无法关闭的 Compose 审阅。它只是免去询问，并不授予删除权限；应用无法安全执行的计划仍会被拒绝。所有操作仍会出现在活动页面。

# Settings_Ai_Perm.OffContent
source: Require approval
zh_hans: 需要批准

# Settings_Ai_Perm.OnContent
source: Run automatically
zh_hans: 自动运行

# Settings_Diag_Header.Text
source: Diagnostics
zh_hans: 诊断

# Settings_Diag_Logs_Label.Text
source: Application logs
zh_hans: 应用日志

# Settings_Diag_Logs_Help.Text
source: Rolling diagnostic logs for troubleshooting. Share these when reporting an issue.
zh_hans: 用于排查问题的滚动诊断日志。报告问题时请附上这些日志。

# Settings_Diag_OpenLogs.Content
source: Open logs folder
zh_hans: 打开日志文件夹

# Settings_Updates_OnLaunch_Label.Text
source: Check for updates when the app starts
zh_hans: 应用启动时检查更新

# Settings_Updates_OnLaunch_Help.Text
source: Look for a newer release on GitHub at launch and offer to install it. Nothing is installed until you choose Update now.
zh_hans: 启动时在 GitHub 上查找更新的发行版并提示安装。在你选择“立即更新”之前不会安装任何东西。

# Settings_Updates_Check.Content
source: Check for updates
zh_hans: 检查更新

# Settings_About_Header.Text
source: About
zh_hans: 关于

# Settings_About_Tagline.Text
source: A native WinUI 3 manager for WSL containers (wslc).
zh_hans: 用于管理 WSL 容器（wslc）的原生 WinUI 3 应用。

# Settings_About_Learn.Content
source: Learn about WSL containers
zh_hans: 了解 WSL 容器

# Settings_About_GitHub.Content
source: View on GitHub
zh_hans: 在 GitHub 上查看

# Settings_About_Report.Content
source: Report an issue
zh_hans: 反馈问题

# Root_AssistantButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Container AI Assistant
zh_hans: 容器 AI 助手

# Root_EngineUnreachable
source: WSL Container Desktop — engine unreachable
zh_hans: WSL Container Desktop — 无法连接引擎

# Root_ContainerUnhealthy
source: · a container is unhealthy
zh_hans: · 有容器健康检查异常

# Root_ContainerDown
source: · a container is down
zh_hans: · 有容器已停止

# Root_StatusUnknown
source: Status: unknown
zh_hans: 状态：未知

# Root_Update_001
source: Update now
zh_hans: 立即更新

# Root_Update_002
source: Updates are available only for the installed app.
zh_hans: 仅安装后的应用支持更新。

# Root_Update_003
source: Not checked yet.
zh_hans: 尚未检查。

# Root_Update_004
source: Update installed
zh_hans: 更新已安装

# Root_Update_005
source: WSL Container Desktop is now version {0}.
zh_hans: WSL Container Desktop 已更新至 {0}。

# Root_Update_006
source: Updated to version {0}.
zh_hans: 已更新至 {0}。

# Root_Update_007
source: The update did not finish
zh_hans: 更新未完成

# Root_Update_008
source: Version {0} was not installed; you are still on {1}. You can try again from Settings.
zh_hans: 未安装 {0}，当前仍为 {1}。可以在设置中重试。

# Root_Update_009
source: The update to {0} did not finish.
zh_hans: 更新至 {0} 的操作未完成。

# Root_Update_010
source: Downloading version {0}
zh_hans: 正在下载 {0}

# Root_Update_011
source: Starting download…
zh_hans: 正在开始下载…

# Root_Update_012
source: Restart WSL Container Desktop to start using version {0}.
zh_hans: 重新启动 WSL Container Desktop 以使用 {0}。

# Root_Update_013
source: Version {0} is installed; restart the app to use it.
zh_hans: 已安装 {0}，重新启动应用后生效。

# Root_Update_014
source: Update failed
zh_hans: 更新失败

# Root_Update_015
source: Try again
zh_hans: 重试

# Root_Update_016
source: The update to {0} failed.
zh_hans: 更新至 {0} 失败。

# Root_Update_017
source: Something unexpected went wrong. The app log has the details.
zh_hans: 发生意外错误，详情见应用日志。

# Root_Update_018
source: Checking for updates…
zh_hans: 正在检查更新…

# Root_Update_019
source: You're up to date (version {0}).
zh_hans: 已是最新版本（{0}）。

# Root_Update_020
source: Version {0} is available.
zh_hans: 发现新版本 {0}。

# Root_Update_021
source: Version {0} is available
zh_hans: 发现新版本 {0}

# Root_Update_022
source: You have {0}. Updating downloads the new version, closes the app, installs it and reopens it. Running containers keep running.
zh_hans: 当前为 {0}。更新会下载新版本、关闭应用、完成安装后重新打开。运行中的容器会继续运行。

# Root_Update_023
source: You have {0}. This copy is not a signed release install, so it can't update itself; get the release from GitHub.
zh_hans: 当前为 {0}。此副本不是已安装的签名发布版，无法自动更新，请从 GitHub 获取发布版。

# Root_Update_024
source: {0}% downloaded.
zh_hans: 已下载 {0}%。

# Root_Update_025
source: Getting ready to install
zh_hans: 正在准备安装

# Root_Update_026
source: The download is complete. The update will install in less than a minute.
zh_hans: 下载已完成，更新将在一分钟内开始安装。

# Root_Update_027
source: Checking the download
zh_hans: 正在检查下载内容

# Root_Update_028
source: Making sure the package is a newer WSL Container Desktop from the same publisher.
zh_hans: 正在确认安装包是同一发布者提供的新版 WSL Container Desktop。

# Root_Update_029
source: Installing the update
zh_hans: 正在安装更新

# Root_Update_030
source: WSL Container Desktop will close, install the update and reopen in a moment.
zh_hans: WSL Container Desktop 将关闭、安装更新，随后重新打开。

# Root_Update_031
source: GitHub is limiting requests from this network right now. Try again later.
zh_hans: GitHub 暂时限制了此网络的请求，请稍后重试。

# Root_Update_032
source: GitHub returned {0} {1} when checking for updates.
zh_hans: 检查更新时 GitHub 返回 {0} {1}。

# Root_Update_033
source: GitHub did not answer the update check in time.
zh_hans: GitHub 未及时响应更新检查。

# Root_Update_034
source: Could not reach GitHub to check for updates.
zh_hans: 无法连接 GitHub 检查更新。

# Root_Update_035
source: GitHub returned an unreadable answer to the update check.
zh_hans: GitHub 的更新检查响应无法读取。

# Root_Update_036
source: Updates are only available for the installed app.
zh_hans: 仅安装后的应用支持更新。

# Root_Update_037
source: This copy is not a signed release install, so it cannot update itself. Install the release from GitHub instead.
zh_hans: 此副本不是已安装的签名发布版，无法自动更新。请从 GitHub 安装发布版。

# Root_Update_038
source: The update download took too long and was stopped.
zh_hans: 更新下载超时，已停止。

# Root_Update_039
source: The downloaded file is not a readable app package.
zh_hans: 下载的文件不是可读取的应用安装包。

# Workload_ComposePage_002.Text
source: Import compose file
zh_hans: 导入 Compose 文件

# Workload_ComposePage_003.Text
source: Refresh
zh_hans: 刷新

source: Restart WSL session
zh_hans: 重启 WSL 会话

# Workload_ComposePage_005.Text
source: Restart WSL session
zh_hans: 重启 WSL 会话

# Workload_ComposePage_006.Text
source: PROJECT
zh_hans: 项目

# Workload_ComposePage_007.Text
source: SERVICES
zh_hans: 服务

# Workload_ComposePage_008.Text
source: STATUS
zh_hans: 状态

# Workload_ComposePage_009.Text
source: ACTIONS
zh_hans: 操作

# Workload_ComposePage_010.Content
source: Manage services
zh_hans: 管理服务

source: Bring up
zh_hans: 启动

source: Up (Apply): apply configuration; keep unchanged running containers
zh_hans: 启动（应用）：应用配置，保留未更改且运行中的容器

source: Restart
zh_hans: 重启

source: Stop and start existing containers without applying configuration or rebuilding
zh_hans: 停止并启动现有容器，不应用配置或重新构建

source: Bring down
zh_hans: 停止并删除容器

source: Remove project
zh_hans: 移除项目

# Workload_ComposePage_015.Text
source: SERVICES
zh_hans: 服务

# Workload_ComposePage_016.Text
source: STATUS
zh_hans: 状态

# Workload_ComposePage_017.Content
source: Manage services
zh_hans: 管理服务

# Workload_ComposePage_022.Text
source: No compose projects. Import a docker-compose.yml to get started.
zh_hans: 没有 Compose 项目。导入 docker-compose.yml 以开始使用。

# Workload_ComposePreviewDialog_001.CloseButtonText
source: Cancel
zh_hans: 取消

# Workload_ComposePreviewDialog_002.Text
source: What this does
zh_hans: 将执行的操作

source: Resolved Compose settings and compatibility
zh_hans: 解析后的 Compose 设置及兼容性

# Workload_DevContainersPage_001.Text
source: Dev Containers
zh_hans: 开发容器

# Workload_DevContainersPage_002.Text
source: Open workspace folder
zh_hans: 打开工作区文件夹

# Workload_DevContainersPage_003.Text
source: Refresh
zh_hans: 刷新

# Workload_DevContainersPage_004.Header
source: Lifecycle log
zh_hans: 生命周期日志

# Workload_DevContainersPage_005.Content
source: Up
zh_hans: 启动

# Workload_DevContainersPage_006.Content
source: Rebuild
zh_hans: 重新构建

# Workload_DevContainersPage_007.Content
source: Rebuild (no cache)
zh_hans: 重新构建（不使用缓存）

# Workload_DevContainersPage_008.Content
source: Open Terminal
zh_hans: 打开终端

# Workload_DevContainersPage_009.Content
source: Stop
zh_hans: 停止

# Workload_DevContainersPage_010.Content
source: Remove
zh_hans: 移除

source: View nodes
zh_hans: 查看节点

# Workload_K8sDashboardSection_002.Text
source: Nodes
zh_hans: 节点

# Workload_K8sDashboardSection_003.Text
source: Ready
zh_hans: 就绪

# Workload_K8sDashboardSection_004.Text
source: Total
zh_hans: 总数

source: View deployments
zh_hans: 查看部署

# Workload_K8sDashboardSection_006.Text
source: Deployments
zh_hans: 部署

# Workload_K8sDashboardSection_007.Text
source: Healthy
zh_hans: 健康

# Workload_K8sDashboardSection_008.Text
source: Total
zh_hans: 总数

source: View pods
zh_hans: 查看 Pod

# Workload_K8sDashboardSection_010.Text
source: Pods
zh_hans: Pod

source: View services
zh_hans: 查看服务

# Workload_K8sDashboardSection_012.Text
source: Services
zh_hans: 服务

source: View ingresses
zh_hans: 查看入口

# Workload_K8sDashboardSection_014.Text
source: Ingresses
zh_hans: 入口

source: View persistent volume claims
zh_hans: 查看持久卷声明

# Workload_K8sDashboardSection_016.Text
source: Persistent Volume Claims
zh_hans: 持久卷声明

source: View config maps
zh_hans: 查看配置映射

# Workload_K8sDashboardSection_018.Text
source: ConfigMaps
zh_hans: 配置映射

source: View secrets
zh_hans: 查看机密

# Workload_K8sDashboardSection_020.Text
source: Secrets
zh_hans: 机密

source: View jobs
zh_hans: 查看任务

# Workload_K8sDashboardSection_022.Text
source: Jobs
zh_hans: 任务

source: View cronjobs
zh_hans: 查看定时任务

# Workload_K8sDashboardSection_024.Text
source: CronJobs
zh_hans: 定时任务

source: View port forwarding
zh_hans: 查看端口转发

# Workload_K8sDashboardSection_026.Text
source: Port Forwarding
zh_hans: 端口转发

# Workload_K8sDashboardSection_027.Text
source: active
zh_hans: 活动

source: Back to Kubernetes
zh_hans: 返回 Kubernetes

source: Scale
zh_hans: 缩放

# Workload_K8sDetailPage_003.Text
source: Scale
zh_hans: 缩放

source: Rolling restart
zh_hans: 滚动重启

source: Run now
zh_hans: 立即运行

# Workload_K8sDetailPage_006.Text
source: Run now
zh_hans: 立即运行

source: Suspend or resume
zh_hans: 暂停或恢复

source: Suspend / resume
zh_hans: 暂停 / 恢复

source: Refresh
zh_hans: 刷新

source: Delete
zh_hans: 删除

# Workload_K8sDetailPage_010.Text
source: Summary
zh_hans: 摘要

# Workload_K8sDetailPage_011.Text
source: Kube
zh_hans: 清单

# Workload_K8sDetailPage_012.Text
source: Describe
zh_hans: 详细状态

# Workload_K8sDetailPage_013.Text
source: Logs
zh_hans: 日志

# Workload_K8sDetailPage_014.Text
source: KIND
zh_hans: 资源类型

# Workload_K8sDetailPage_015.Text
source: NAME
zh_hans: 名称

# Workload_K8sDetailPage_016.Text
source: SCOPE
zh_hans: 作用域

# Workload_K8sDetailPage_017.Text
source: Use the Kube tab to view and edit the full manifest, or Describe for a detailed status view.
zh_hans: 使用“清单”选项卡查看和编辑完整清单，使用“详细状态”查看具体状态。

# Workload_K8sDetailPage_018.Text
source: Apply changes to cluster
zh_hans: 将更改应用到集群

# Workload_K8sDetailPage_019.Text
source: Reload
zh_hans: 重新加载

# Workload_K8sDetailPage_020.Text
source: Refresh logs
zh_hans: 刷新日志

# Workload_KubernetesPage_002.Text
source: k3s single-node cluster
zh_hans: k3s 单节点集群

# Workload_KubernetesPage_003.Text
source: Running
zh_hans: 运行中

# Workload_KubernetesPage_004.Text
source: Starting
zh_hans: 正在启动

# Workload_KubernetesPage_005.Text
source: Stopped
zh_hans: 已停止

# Workload_KubernetesPage_006.Text
source: Not installed
zh_hans: 未安装

# Workload_KubernetesPage_007.Text
source: Unavailable
zh_hans: 不可用

# Workload_KubernetesPage_008.Text
source: Node:
zh_hans: 节点：

# Workload_KubernetesPage_009.Text
source: Version:
zh_hans: 版本：

# Workload_KubernetesPage_010.Text
source: Distro:
zh_hans: 发行版：

# Workload_KubernetesPage_011.Text
source: Install Kubernetes
zh_hans: 安装 Kubernetes

# Workload_KubernetesPage_012.Text
source: Start
zh_hans: 启动
